#Список покупок
# Створи програму, яка дозволяє користувачу керувати списком покупок. Програма повинна:

# Додати товар до списку покупок.
# Видалити товар зі списку.
# Показати весь список покупок.
# Завершити роботу програми.
# Вимоги:
# Список покупок має зберігатися у вигляді словника, де ключ — назва товару, а значення — кількість.
# Використовуй методи словників (dict) для роботи зі списком.

покупки = {}

while True:
    print("\nСПИСОК ПОКУПОК")
    print("1. Додати покупку")
    print("2. Видалити покупку")
    print("3. Переглянути всі покупки")
    print("4. Вихід")
    choice = input("виберіть дію  (1-4): ")
    if choice == '1':
        назва = input("введіть назву покупки: ")
        кількість = int(input("введіть кількісьть данного товару: "))
        покупки[назва] = кількість
        print(f"Додано: {назва} - {кількість} шт.")
    elif choice == '2':
        назва = input("введіть назву товару яку треба видалити: ")
        if назва in покупки:
            del покупки[назва]
            print(f"товар {назва} видалено зі  списку покупок")
        else:
            print("товар з такою назвою не знайдено!")
    elif choice == '3':
        if покупки:
            print("\nВаш список покупок:")
            for товар, кількість in покупки.items():
                print(f"{товар}: {кількість} шт.")
        else:
            print("\nВаш список покупок порожній.")
    elif  choice == '4':
        print("завершення програми ...")          
        break
    else:
        print("невідома команда")
        