# def додати_два(x):
#     return x + 2

# додати_два = lambda x: x + 2

# print(додати_два(5))

# вартість_піци = lambda базова_ціна, інгредієнти: базова_ціна + інгредієнти * 20
# print(вартість_піци(100, 3))

# очки = lambda базові, бонус: базові + бонус * 2
# print(очки(50, 10))  

# площа = lambda довжина , ширина : довжина * ширина
# print(площа(5,12))

# середній_бал = lambda оцінки: sum(оцінки) / len(оцінки)
# print(середній_бал([12, 10, 8, 11]))

# знижка = lambda ціна: ціна * 0.7
# print(знижка(1000))

