# CЛОВНИКИ 

# мій_словник = {
#     "ключ1": "значення1",
#     "ключ2": "значення2"
# }

  #------------------------------------------------------

# poshuk za kluchem ta dodavannya novih statusiv

# my_dictionary = {
#     "name": "Радислав",
#     "age": 15
# }
# my_dictionary["level"] = "GOD"
# my_dictionary["level"] = "bad"
# for key  in my_dictionary.items():
#     print(f"{key}")



#------------------------------------------------------

# character1 = {
#     "name" : "barman",
#     "powerfull": 58,
#     "health" : 100
# }
# character1["weapon"] = "sword"
# character1["health"]-=30
# del character1["weapon"]
# print(character1)


#------------------------------------------------------

# профіль = {
#     "ім'я": "Богдан",
#     "вік": 33,
#     "навички": ["Python", "Django", "SQL"],
#     "адреса": {"місто": "Київ", "країна": "Україна"}
# }
# if "ім'я" in профіль:
#     print("має")

#------------------------------------------------------

# гра = {
#     "герой": {
#         "ім'я": "Лілія",
#         "вік": 14
#     },
#     "локація": {
#         "назва": "Чарівний ліс",
#         "вороги": ["тролі", "вовки"]
#     }
# }
# print(гра["герой"]["ім'я"])  
# print(гра["локація"]["вороги"])  

#------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# print(словник.get("ім'я"))  
# print(словник.get("адреса", "Не вказано"))

# ------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# print(словник.keys())
# print(словник.values())

# ------------------------------------------------------

# словник = {"ім'я": "Богдан"}
# словник.update({"вік": 33, "місто": "Тернопіль"})
# print(словник)

# ------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# вік = словник.pop("вік")
# print(вік)  
# print(словник)

# ------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# останнє = словник.popitem()
# print(останнє)  
# print(словник)

# ------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# словник.clear()
# print(словник)

# ------------------------------------------------------

# словник = {"ім'я": "Богдан", "вік": 33}
# копія = словник.copy()
# print(копія)

# ------------------------------------------------------

# словник = {"ім'я": "Богдан"}
# значення = словник.setdefault("вік", 33)
# print(значення) 
# print(словник)

# ------------------------------------------------------

# ------------------------------------------------------

# ------------------------------------------------------
